Enums/ВидыНалоговВзносовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНалоговВзносовОтчислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОППВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РежимНачисленияЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РежимНачисленияЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОкончательныйРасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПервойПоловиныМесяца</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УчетНалоговВзносовОтчисленийКлиентРасширенный/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура открывает общую форму, показывающую, какие вычеты были применены при расчете ИПН в документе.
//
// Параметры:
//	Объект					- ДанныеФормаСтруктура, основной реквизит формы документа.
//	ИмяДокумента			- Строка, имя документа.
//	Владелец				- УправляемаяФорма, элемент, в который необходимо возвратить результат оповещения.
//	ОписаниеДокумента		- Структура
//	УчитываемыеСотрудники	- СправочникСсылка.Сотрудники
//							- СправочникСсылка.ФизическиеЛица
//							- Массив
//
// Возвращаемое значение
//	Форма при закрытии отправляет оповещение владельцу, с которым передается содержимое ТЧ НалогиВзносыОтчисления по ИПН
//
Процедура ОткрытьФормуРасчетаНалогаВзносаОтчисления(Объект, Владелец, ДополнительныеПараметрыНВО, ОписаниеДокумента, ТолькоПросмотр = Истина) Экспорт
	
	МесяцНачисления = Объект[ОписаниеДокумента.МесяцНачисленияИмя];
	ВидыНалогаВзносаОтчисления = ДополнительныеПараметрыНВО.ВидНалогаВзносаОтчисления;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Объект", Объект);
	ПараметрыФормы.Вставить("ДополнительныеПараметрыНВО", ДополнительныеПараметрыНВО);
	ПараметрыФормы.Вставить("НалогиВзносыОтчисления", Владелец.СведенияОНалогахВзносахОтчислениях(ВидыНалогаВзносаОтчисления));
	Если ВидыНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ИПН") Тогда
		ПараметрыФормы.Вставить("ВычетыИПН", Владелец.ВычетыИПН());
	КонецЕсли;
	Если ВидыНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП")
		И ОписаниеДокумента.РежимНачисления = ПредопределенноеЗначение("Перечисление.РежимНачисленияЗарплаты.ОкончательныйРасчет") Тогда
		ПараметрыФормы.Вставить("КомпонентыЕП", Владелец.КомпонентыЕП());
	КонецЕсли;
	ПараметрыФормы.Вставить("ДоходыНеПодлежащиеНалогообложению", Владелец.ДоходыНеПодлежащиеНалогообложению(ВидыНалогаВзносаОтчисления));
	ПараметрыФормы.Вставить("ОписаниеДокумента", ОписаниеДокумента);
	ПараметрыФормы.Вставить("МесяцНачисления", Объект[ОписаниеДокумента.МесяцНачисленияИмя]);
	ПараметрыФормы.Вставить("ТолькоПросмотр", (ТолькоПросмотр И НЕ ВидыНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП")) ИЛИ Владелец.ТолькоПросмотр);
	
	ОткрытьФорму("ОбщаяФорма.ПодробнееОРасчетеНалогаВзносаОтчисления", ПараметрыФормы, Владелец);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

//Процедура обработки события "ПередУдалением" табличной части "НалогиВзносыОтчисления"
//
Процедура НалогиВзносыОтчисленияПередУдалением(Форма, НалогиВзносыОтчисленияТекущиеДанные, Отказ) Экспорт
	
	Форма.УдаляемыйИдентификаторСтрокиНалогиВзносыОтчисления = НалогиВзносыОтчисленияТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления;
	
КонецПроцедуры

//Процедура обработки события "ПослеУдаления" табличной части "НалогиВзносыОтчисления"
//
Процедура НалогиВзносыОтчисленияПослеУдаления(Форма) Экспорт
	
	МассивСтрок = Форма.Объект.ВычетыИПН.НайтиСтроки(
		Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления",Форма.УдаляемыйИдентификаторСтрокиНалогиВзносыОтчисления));
	
	Для каждого Строка Из МассивСтрок Цикл
		Форма.Объект.ВычетыИПН.Удалить(Строка);
	КонецЦикла;
	
	Если Форма.Объект.Свойство("КомпонентыЕП") Тогда
		
		МассивСтрок = Форма.Объект.КомпонентыЕП.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления",Форма.УдаляемыйИдентификаторСтрокиНалогиВзносыОтчисления));
		
		Для каждого Строка Из МассивСтрок Цикл
			Форма.Объект.КомпонентыЕП.Удалить(Строка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
